app/views/users/impressao_user.html.erb

SELECT `roles`.* FROM `roles` WHERE (name = 'entidade' and authorizable_type IS NULL and authorizable_id IS NULL) LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
        <td>
          <%= (User.find(user.id).has_role? :administrador )? 'Administrador':'' %>