app/views/doacaos/_form.html.erb

SELECT `doatipos`.* FROM `doatipos`
---
    <%= f.label :doatipo_id, "Tipo Doação" %><br />
    <%= f.collection_select(:doatipo_id, Doatipo.all, :id, :nome, :prompt => 'Selecione um Tipo') %>

SELECT `entidades`.* FROM `entidades`
---
    <%= f.label :entidade_id, "Entidade Social Favorecida:" %><br />
    <%= f.collection_select(:entidade_id, Entidade.all, :id, :nomefantasia, :prompt => 'Selecione Entidade') %>