app/views/generals/_conta.html.erb

SELECT `bancos`.* FROM `bancos`
---
  <%= f.label :banco_id, "Banco" %><br />
  <%= f.collection_select(:banco_id, Banco.all, :id, :nome) %>