app/controllers/contatos_controller.rb

  def index
    if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
      @contatos = Contato.paginate(:page => params[:page], :order => 'created_at') rescue nil
---
SELECT `contatos`.* FROM `contatos` WHERE (contatos. LIKE '%fghjfghj%') ORDER BY created_at LIMIT 30 OFFSET 0

  def show
    @contato = Contato.find(params[:id])
---
SELECT `contatos`.* FROM `contatos` WHERE `contatos`.`id` = 3 LIMIT 1

  def edit
    @contato = Contato.find(params[:id])
---
SELECT `contatos`.* FROM `contatos` WHERE `contatos`.`id` = 1 LIMIT 1

  def create
    @contato = Contato.new(params[:contato])

    respond_to do |format|
      if @contato.save
        format.html { redirect_to(@contato, :notice => 'Contato foi mandado com sucesso.'+
              "#{CountMail.enviar_email("Administrador", "tiagovtg@gmail.com", "Um contato novo foi registrado.",
            "Voce tem um novo contato mandando por #{@contato.nome} em #{@contato.created_at}, assunto: #{@contato.assunto}")}") }#manda email
---
INSERT INTO `contatos` (`telefone`, `updated_at`, `email`, `assunto`, `mensagem`, `nome`, `created_at`) VALUES ('(73)2454-2345', '2011-06-22 20:14:17', 'adriana@teste.com', 'Elogio', 'testando seu sistema, esta muito bom.', 'Adriana Tiago', '2011-06-22 20:14:17')
INSERT INTO `count_mails` (`updated_at`, `enviados`, `created_at`) VALUES ('2011-06-22 20:14:17', 0, '2011-06-22 00:00:00')