app/controllers/doacaos_controller.rb

  def index
    if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
      if administrador?
        @doacaos = Doacao.paginate(:page => params[:page], :order => 'data DESC')
---
SELECT `doacaos`.* FROM `doacaos` WHERE (doacaos.nome LIKE '%c%') ORDER BY data DESC LIMIT 10 OFFSET 0

  def show
    @doacao = Doacao.find(params[:id])
---
SELECT `doacaos`.* FROM `doacaos` WHERE `doacaos`.`id` = 2 LIMIT 1

  def edit
    @doacao = Doacao.find(params[:id])
---
SELECT `doacaos`.* FROM `doacaos` WHERE `doacaos`.`id` = 1 LIMIT 1

  def create
    @doacao = Doacao.new(params[:doacao])
    #    @doacao.voluntario_id
    #    @doacao.empresa_id
    #    @doacao.entidade_id

    #       @voluntario.user_id = current_user.id

    respond_to do |format|
      if @doacao.save
---
INSERT INTO `doacaos` (`doatipo_id`, `obs`, `data`, `entidade_id`, `user_id`, `valor`, `created_at`, `valida`, `updated_at`) VALUES (1, 'Gostaria de ajudar a arquitetar alguma obra de caridade sem custo.', '2011-06-09', 1, 3, NULL, '2011-06-09 18:24:34', NULL, '2011-06-09 18:24:34')

  def update
    @doacao = Doacao.find(params[:id])

    respond_to do |format|
      if @doacao.update_attributes(params[:doacao])
---
SELECT `doacaos`.* FROM `doacaos` WHERE `doacaos`.`id` = 2 LIMIT 1
UPDATE `doacaos` SET `updated_at` = '2011-06-09 16:29:54', `obs` = 'Quero trabalhar nos fins de semana com vcs, estao precisando de professor?' WHERE `doacaos`.`id` = 1