app/controllers/emergencia_controller.rb

  def index
    @entidade = Entidade.where(" user_id = ?", current_user.id)
    if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
      if administrador?
        @emergencia = Emergencium.paginate(:page => params[:page], :order => 'validacao, data DESC')
      else
        @emergencia = Emergencium.paginate(:page => params[:page], :order => 'validacao, data DESC', :conditions => [" entidade_id = ?", @entidade[0].id])
      end
    else
      if params[:filtro]=="Buscar por..." or params[:filtro].nil? or params[:filtro].empty?
        #        flash[:notice] = "Favor preencher o campo de busca por..."
      else
        if administrador?
          @emergencia = Emergencium.paginate(:page => params[:page], :order => 'validacao, data DESC', :conditions => ['emergencia.'+"#{params[:filtro]}"+' LIKE ?', "%#{params[:query]}%"])
---
SELECT `entidades`.* FROM `entidades` WHERE `entidades`.`id` = 1 LIMIT 1
SELECT `emergencia`.* FROM `emergencia` WHERE ( entidade_id = 1) ORDER BY validacao, data DESC LIMIT 10 OFFSET 0

  def show
    if administrador?
      @emergencium = Emergencium.find(params[:id])
    else
      @entidade = Entidade.where(" user_id = ?", current_user.id)
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 2)

  def edit
    if administrador?
      @emergencium = Emergencium.find(params[:id])
    else
      @entidade = Entidade.where(" user_id = ?", current_user.id)
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 2)

  def create
    @emergencium = Emergencium.new(params[:emergencium])
    @entidade = Entidade.where(" user_id = ?", current_user.id)
    unless @entidade.nil? or @entidade.empty?
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 2)
SELECT COUNT(*) FROM `entidades` WHERE ( user_id = 1)

  def update
    if administrador?
      @emergencium = Emergencium.find(params[:id])

      respond_to do |format|
        if @emergencium.update_attributes(params[:emergencium])
          format.html { redirect_to(@emergencium, :notice => 'Emergencia foi alterado(a) com sucesso.') }
        else
          format.html { render :action => "edit" }
          format.xml  { render :xml => @emergencium.errors, :status => :unprocessable_entity }
        end
      end
    else
      @entidade = Entidade.where(" user_id = ?", current_user.id)
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 2)