app/controllers/empresas_controller.rb

SELECT `empresas`.* FROM `empresas` WHERE ( user_id = 4) ORDER BY cnpj LIMIT 10 OFFSET 0
---
  def index
    if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
      if administrador?
        @empresas = Empresa.paginate(:page => params[:page], :order => 'cnpj')

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`user_id` = 4 LIMIT 1
---
  def show
    if administrador?
      @empresa = Empresa.find(params[:id])
    else
      @empresa = Empresa.where(" user_id = ?", current_user.id) rescue nil

SELECT `empresas`.* FROM `empresas` WHERE ( user_id = 1)
---
  def new
    @empresa = Empresa.all(:conditions => [" user_id = ?", current_user.id])

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1
---
  def edit
    @empresa = Empresa.find(params[:id])

INSERT INTO `empresas` (`sexo`, `cnpj`, `nomefantasia`, `numero`, `site`, `bairro`, `created_at`, `datanasc`, `cep`, `updated_at`, `apelido`, `areaatuacao`, `nome`, `cpf`, `razaosocial`, `cidade`, `user_id`, `ramoatividade`, `estado`, `endereco`, `complemento`) VALUES ('Feminino', '62.265.164/0001-06', 'Coca Cola Company', '201', 'www.cocacola.com.br', '', '2011-06-09 18:27:26', '1961-03-20', '76.578-458', '2011-06-09 18:27:26', 'Mary', 'Bebidas', 'Maria Costa', '689.817.671-49', 'Coca&Cola', 'Brasilia', 4, 'Bebidas', 'DF', 'QD 03 conj 33', '')
---
  def create
    @empresa = Empresa.new(params[:empresa])
    @empresa.user_id = current_user.id

    respond_to do |format|
      if @empresa.save