app/controllers/entidades_controller.rb

  def index
    if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
      if administrador?
        @entidades = Entidade.paginate(:page => params[:page], :order => 'cnpj')
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 4) ORDER BY cnpj LIMIT 10 OFFSET 0

  def show
    if administrador?
      @entidade = Entidade.find(params[:id])
---
SELECT `entidades`.* FROM `entidades` WHERE `entidades`.`id` = 2 AND ( user_id = 5) LIMIT 1

  def new

    # verifica se ja existe uma entidade criada.
    if administrador?
      @entidade = Entidade.new
    else
      @entidades = Entidade.all(:conditions => [" user_id = ?", current_user.id])
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 1)

  def edit
    if administrador?
      @entidade = Entidade.find(params[:id])
---
SELECT `entidades`.* FROM `entidades` WHERE `entidades`.`id` = 2 AND ( user_id = 5) LIMIT 1

  def create
    @entidade = Entidade.new(params[:entidade])
    @entidade.user_id = current_user.id

    respond_to do |format|
      if @entidade.save
---
INSERT INTO `entidades` (`apelido`, `estado`, `nome`, `causa_id`, `updated_at`, `sexo`, `areaatuacao`, `siteproprio`, `complemento`, `datanasc`, `cpf`, `cidade`, `site`, `bairro`, `cep`, `numero`, `datafunda`, `nomefantasia`, `created_at`, `user_id`, `cnpj`, `endereco`, `razaosocial`) VALUES ('WERTWERT', 'MT', 'hjgkjhg', 2, '2011-06-10 13:41:56', NULL, 'social', NULL, '', '1920-06-10', '689.817.671-49', 'ertwetr', '', '', '40.657-987', '12341234', '2011-06-10', 'Entidade 2', '2011-06-10 13:41:56', 5, '62.526.867/0001-32', 'sfasdf', 'razao social')

  def update
    if administrador?
      @entidade = Entidade.find(params[:id])

      respond_to do |format|
        if @entidade.update_attributes(params[:entidade])
          format.html { redirect_to(@entidade, :notice => 'Entidade was successfully updated.') }
          format.xml  { head :ok }
        else
          format.html { render :action => "edit" }
          format.xml  { render :xml => @entidade.errors, :status => :unprocessable_entity }
        end
      end
    else
      @entidade = Entidade.find(params[:id], :conditions => [" user_id = ?", current_user.id]) rescue nil
      unless @entidade.nil?
        respond_to do |format|
          if @entidade.update_attributes(params[:entidade])
---
SELECT `entidades`.* FROM `entidades` WHERE `entidades`.`id` = 1 LIMIT 1
UPDATE `entidades` SET `cidade` = 'Sao Paulo', `causa_id` = 1, `site` = 'www.hospitaldocancer.com.br', `areaatuacao` = 'Saúde', `updated_at` = '2011-06-09 18:04:03', `endereco` = 'Rua Pedro Alves', `estado` = 'SP', `datanasc` = '1962-06-15', `datafunda` = '1977-11-08', `siteproprio` = 'sim', `nomefantasia` = 'Hospital do Cançer' WHERE `entidades`.`id` = 1
UPDATE `users` SET `updated_at` = '2011-06-09 16:13:26', `last_request_at` = '2011-06-09 16:13:26', `perishable_token` = 'jjujmKWTQ54uhUFiMXlB' WHERE `users`.`id` = 1