app/controllers/newsletters_controller.rb

SELECT `newsletters`.* FROM `newsletters` ORDER BY email LIMIT 10 OFFSET 0
---
  def index
    if administrador?
      if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
        @newsletters = Newsletter.paginate(:page => params[:page], :order => 'email')

SELECT `newsletters`.* FROM `newsletters` WHERE `newsletters`.`id` = 1 LIMIT 1
---
  def edit
    @newsletter = Newsletter.find(params[:id])

INSERT INTO `count_mails` (`enviados`, `created_at`, `updated_at`) VALUES (0, '2011-06-22 00:00:00', '2011-06-22 14:50:32')
INSERT INTO `newsletters` (`updated_at`, `nome`, `created_at`, `email`) VALUES ('2011-06-10 09:09:30', 'tiago', '2011-06-10 09:09:30', 'tiagovtg@gmail.com')
---
  def create
    @newsletter = Newsletter.new(params[:newsletter])

    respond_to do |format|
      if @newsletter.save
        format.html { redirect_to(@newsletter, :notice => 'Newsletter criado(a) com sucesso.'+
              "#{CountMail.enviar_email(@newsletter.nome, @newsletter.email, "Registrado no newsletter do Click Solidario.",
            "Obrigado. Voce recebera em breve conteúdo e novidades do Click Solidario.")}") }#manda email

SELECT `newsletters`.* FROM `newsletters` WHERE `newsletters`.`id` = 2 LIMIT 1
DELETE FROM `newsletters` WHERE `newsletters`.`id` = 2
---
  def destroy
    @newsletter = Newsletter.find(params[:id])
    @newsletter.destroy