app/controllers/noticia_controller.rb

  def index
    @entidade = Entidade.where(" user_id = ?", current_user.id)
    if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
      if administrador?
        @noticia = Noticium.paginate(:page => params[:page], :order => 'validacao, data DESC')
      else
        @noticia = Noticium.paginate(:page => params[:page], :order => 'validacao, data DESC', :conditions => [" entidade_id = ?", @entidade[0].id])
      end
    else
      if params[:filtro]=="Buscar por..." or params[:filtro].nil? or params[:filtro].empty?
        #        flash[:notice] = "Favor preencher o campo de busca por..."
      else
        if administrador?
          @noticia = Noticium.paginate(:page => params[:page], :order => 'validacao, data DESC', :conditions => ['noticia.'+"#{params[:filtro]}"+' LIKE ?', "%#{params[:query]}%"])
---
SELECT `entidades`.* FROM `entidades` WHERE `entidades`.`id` = 1 LIMIT 1
SELECT `noticia`.* FROM `noticia` WHERE ( entidade_id = 1) ORDER BY validacao, data DESC LIMIT 10 OFFSET 0

  def show
    if administrador?
      @noticium = Noticium.find(params[:id])
    else
      @entidade = Entidade.where(" user_id = ?", current_user.id)
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 2)

  def edit
    if administrador?
      @noticium = Noticium.find(params[:id])
    else
      @entidade = Entidade.where(" user_id = ?", current_user.id)
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 2)

  def create
    @noticium = Noticium.new(params[:noticium])
    @entidade = Entidade.where(" user_id = ?", current_user.id)
    unless @entidade.nil? or @entidade.empty?
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 2)
SELECT COUNT(*) FROM `entidades` WHERE ( user_id = 2)

  def update
    if administrador?
      @noticium = Noticium.find(params[:id])
      respond_to do |format|
        if @noticium.update_attributes(params[:noticium])
          flash[:notice] ='Noticia alterado(a) com sucesso.'
          format.html { redirect_to(@noticium) }
        else
          format.html { render :action => "edit" }
          format.xml  { render :xml => @noticium.errors, :status => :unprocessable_entity }
        end
      end
    else
      @entidade = Entidade.where(" user_id = ?", current_user.id)
---
SELECT `entidades`.* FROM `entidades` WHERE ( user_id = 2)