app/controllers/portal_controller.rb

SELECT COUNT(*) FROM `entidades` WHERE ( entidades.estado LIKE '%AL%' ) LIMIT 10
SELECT `entidades`.* FROM `entidades` WHERE ( entidades.estado LIKE '%DF%' and entidades.causa_id = 2 ) ORDER BY cnpj LIMIT 10
---
  def busca_solidaria
    # o nome da action, tem que conter na mesma pasta, um arquivo com extensao, js.erb
    # o nome da variavel de instancia, dentro do js.erb, e na action, tem que ser o nome da partial
    # de preferencia no mesmo local.
    # nao precisa ter o render @variavel em lugar nenhum.
    # basta $("# div a trocar").html


    #    if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
    #      @entidades = Entidade.paginate(:page => params[:page], :order => 'cnpj')
    #    else
    #      unless params[:filtro]=="Buscar por..." or params[:filtro].nil? or params[:filtro].empty?
    #        @entidades = Entidade.paginate(:page => params[:page], :order => 'cnpj', :conditions => ['entidades.'+"#{params[:filtro]}"+' LIKE ?', "%#{params[:query]}%"])
    #      end
    #    end
    @lista_entidades = Entidade.paginate(:page => params[:page], :order => 'cnpj')