app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (users.email LIKE '%entidade%') ORDER BY nome LIMIT 10 OFFSET 0
---
  def index
    if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
      if administrador?
        @user = User.paginate(:page => params[:page], :order => 'nome')

INSERT INTO `users` (`newsletter`, `failed_login_count`, `last_request_at`, `current_login_ip`, `updated_at`, `email`, `status`, `crypted_password`, `persistence_token`, `perishable_token`, `password_salt`, `nome`, `single_access_token`, `created_at`) VALUES (1, 0, '2011-06-09 18:18:26', '127.0.0.1', '2011-06-09 18:18:26', 'volluntario@teste.com', 'Ativo', 'cfe793692752424d9bdcd7eca9435e8b9a10d58e218a063e83a4bf61ab535789eaf5efa0a5cc295844af8930a04abc1517095c689e377e5f41dfa368b06e1810', 'b8779e6d85b2e0287afa5b6ee9d18db23574eb248ccd65a4cca1d951a4a4e6faec295d875f9b9baae261ae649a5578cc6f4128347767e4acd56592474f4ad23d', '85iPoURvNbzfxWYHXW2Y', 'MDKNiwhdP4kWhr2Nrxcl', 'Voluntario', '4m5hGCD95CnPZh0Wikz4', '2011-06-09 18:18:26')
INSERT INTO `newsletters` (`created_at`, `email`, `updated_at`, `nome`) VALUES ('2011-06-09 18:18:26', 'volluntario@teste.com', '2011-06-09 18:18:26', 'Voluntario')
---
  def create
    @user = User.new(params[:user])
    @user.status = "Ativo" # status A  Ativado

    if (( params[:tipo]=='administrador' and !(administrador?)) or (params[:tipo].nil? or params[:tipo].empty?))
      flag=true
    else

      if @user.save
        #cria um newsletter caso o user tenha aceitado a opção.
        if @user.newsletter
          #          Salvando email para newsletter
          @email = Newsletter.new(:nome=>@user.nome, :email=>@user.email)
          @email.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `perishable_token` = 'pDU7nlD4oCovG3dQ5RDh', `updated_at` = '2011-06-10 16:25:44', `last_request_at` = '2011-06-10 16:25:44' WHERE `users`.`id` = 1
SELECT `newsletters`.`id` FROM `newsletters` WHERE (`newsletters`.`email` = BINARY 'volluntario@teste.com') LIMIT 1
INSERT INTO `newsletters` (`email`, `updated_at`, `created_at`, `nome`) VALUES ('volluntario@teste.com', '2011-06-10 16:25:45', '2011-06-10 16:25:45', 'Voluntario')
---
  def update
    @user = User.find(params[:id])
    # Faz a verificação se perfil é administrador
    if administrador?
      @user.has_no_roles!
      @user.has_role! params[:tipo]
    end

    # Verifica se a conta cadatrada do user não é administrador
    if @user.id != 1
      # Altera dados do usuário
      # usuario so pode alterar sua propria conta.
      if @user.id == current_user.id or administrador?
        if @user.update_attributes(params[:user])
          #se o usuario nao quiser mais o newsletter....
          unless @user.newsletter
            if @email = Newsletter.find_by_email(@user.email) rescue nil
              unless @email.nil?
                @email.destroy
              end
            end
          else
            #usuario quer incluir de novo o email.
            if @user.newsletter
              @email = Newsletter.new(:nome=>@user.nome, :email=>@user.email)
              @email.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def load_user
    if administrador?
      @user = User.find(params[:id])