app/controllers/voluntarios_controller.rb

  def index
    if params[:query]=="Digitar..." or params[:query].nil? or params[:query].empty?
      if administrador?
        @voluntarios = Voluntario.paginate(:page => params[:page], :order => 'cpf')
---
SELECT `voluntarios`.* FROM `voluntarios` ORDER BY cpf LIMIT 10 OFFSET 0

  def show
    @voluntario = Voluntario.find(params[:id])
---
SELECT `voluntarios`.* FROM `voluntarios` WHERE `voluntarios`.`id` = 1 AND ( user_id = 3) LIMIT 1

  def new
    @voluntario = Voluntario.all(:conditions => [" user_id = ?", current_user.id])
---
SELECT `voluntarios`.* FROM `voluntarios` WHERE ( user_id = 1)

  def create
    @voluntario = Voluntario.new(params[:voluntario])
    @voluntario.user_id = current_user.id

    respond_to do |format|
      if @voluntario.save
---
INSERT INTO `voluntarios` (`nome`, `cpf`, `cidade`, `bairro`, `sexo`, `numero`, `complemento`, `created_at`, `datanasc`, `updated_at`, `estado`, `user_id`, `apelido`, `profissao`, `cep`, `endereco`) VALUES ('Voluntario da Silva', '689.817.671-49', 'Guara', 'central', 'Masculino', '12', 'n tem', '2011-06-09 18:19:52', '1920-06-09', '2011-06-09 18:19:52', 'DF', 3, 'Voluntario', 'Arquiteto', '86.586-4', 'avenida 04 centro casa')